app/controllers/articles_controller.rb

  def create
    /render plain: params[:article].inspect
      ghi ra
    /
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "d"], ["text", "d"], ["created_at", 2016-10-25 03:31:31 UTC], ["updated_at", 2016-10-25 03:31:31 UTC]]

  def destroy
      @article = Article.find(params[:id])
      @article.delete
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]